app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = Chef.first
    if @recipe.save
---
SELECT "chefs".* FROM "chefs" ORDER BY "chefs"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "chef_id") VALUES (?, ?, ?, ?, ?)

  def update

    if@recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "updated recipe name"], ["description", "updated recipe description"], ["updated_at", "2023-01-22 15:58:44.108361"], ["id", 980190963]]

  def destroy
    Recipe.find(params[:id]).destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 980190963]]